## Number of Employees

In [5]:
# import library
import pandas as pd

In [6]:
# read the CSV
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [7]:
# df.head()

In [8]:
# specify the column to count
col_to_count = 'employee_count'
series = df[col_to_count].value_counts()

In [9]:
series

1-10          17014
11-50         10452
unknown        5882
51-100         1490
101-250        1419
251-500         484
501-1000        195
1001-5000       171
10000+           47
5001-10000       44
Name: employee_count, dtype: int64

In [10]:
# drop the undesired labels
labels_to_drop = ['unknown']
series.drop(labels=labels_to_drop, inplace=True)

In [11]:
series

1-10          17014
11-50         10452
51-100         1490
101-250        1419
251-500         484
501-1000        195
1001-5000       171
10000+           47
5001-10000       44
Name: employee_count, dtype: int64

In [12]:
temp = series['10000+']
series.drop(labels='10000+', inplace=True)
series['10000+'] = temp

In [13]:
series

1-10          17014
11-50         10452
51-100         1490
101-250        1419
251-500         484
501-1000        195
1001-5000       171
5001-10000       44
10000+           47
Name: employee_count, dtype: int64

In [14]:
df = series.to_frame()

In [15]:
df

            employee_count
1-10                 17014
11-50                10452
51-100                1490
101-250               1419
251-500                484
501-1000               195
1001-5000              171
5001-10000              44
10000+                  47

In [16]:
df.reset_index(inplace=True)

In [17]:
df

        index  employee_count
0        1-10           17014
1       11-50           10452
2      51-100            1490
3     101-250            1419
4     251-500             484
5    501-1000             195
6   1001-5000             171
7  5001-10000              44
8      10000+              47

In [18]:
# rename in the dict
df.rename(columns={'employee_count': 'freq', 'index': 'employee_count'}, inplace=True)

In [19]:
df

  employee_count   freq
0           1-10  17014
1          11-50  10452
2         51-100   1490
3        101-250   1419
4        251-500    484
5       501-1000    195
6      1001-5000    171
7     5001-10000     44
8         10000+     47

In [20]:
# output df or series
# uncomment to output a lightweight csv
# df.to_csv("employee_count.csv", index=False)
df.to_string(index=False)

'employee_count   freq\n          1-10  17014\n         11-50  10452\n        51-100   1490\n       101-250   1419\n       251-500    484\n      501-1000    195\n     1001-5000    171\n    5001-10000     44\n        10000+     47'

## Company Age

In [68]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

categories = ['Financial Services', 'FinTech', 'Finance', 'Payments']
cols_to_keep = ['founded_on', *categories]
df = df[cols_to_keep]
df

       founded_on  Financial Services  FinTech  Finance  Payments
0          3.0767                   0        0        0         0
1          5.6658                   0        0        0         0
2         10.0822                   0        0        0         0
3          3.0767                   0        0        0         0
4          9.2219                   0        0        0         0
...           ...                 ...      ...      ...       ...
37193      7.0795                   0        0        0         0
37194      9.0822                   0        0        0         0
37195      6.4795                   0        0        0         0
37196      7.9479                   0        0        0         0
37197      6.0795                   0        0        0         0

[37198 rows x 5 columns]

In [69]:
df['founded_on'] = df['founded_on'].round(0).astype(int)
df.head()

   founded_on  Financial Services  FinTech  Finance  Payments
0           3                   0        0        0         0
1           6                   0        0        0         0
2          10                   0        0        0         0
3           3                   0        0        0         0
4           9                   0        0        0         0

In [70]:
df_count_all =  df['founded_on'].value_counts().sort_index().to_frame()
df_count_all.reset_index(inplace=True)
df_count_all.rename(columns={'index': 'company_age', 'founded_on': 'All'}, inplace=True)
df_count_all

    company_age   All
0             0   138
1             1  1278
2             2  2539
3             3  5195
4             4  5169
5             5  4680
6             6  4708
7             7  4338
8             8  3500
9             9  3136
10           10  2517

In [71]:
df_category_counts = [df_count_all]

for _ in categories:
    temp = df[df[_] == 1]
    df_count = temp['founded_on'].value_counts().sort_index().to_frame()
    df_count.reset_index(inplace=True)
    df_count.rename(columns={'index': 'company_age', 'founded_on': _},inplace=True)
    df_category_counts.append(df_count)

df_category_counts

[    company_age   All
 0             0   138
 1             1  1278
 2             2  2539
 3             3  5195
 4             4  5169
 5             5  4680
 6             6  4708
 7             7  4338
 8             8  3500
 9             9  3136
 10           10  2517,
     company_age  Financial Services
 0             0                  11
 1             1                  69
 2             2                 141
 3             3                 192
 4             4                 246
 5             5                 241
 6             6                 245
 7             7                 225
 8             8                 189
 9             9                 174
 10           10                 149,
     company_age  FinTech
 0             0       11
 1             1       69
 2             2       68
 3             3       66
 4             4       62
 5             5       43
 6             6       19
 7             7       20
 8             8       18
 9             9        8
 10           10        2,
     company_age  Finance
 0             0        3
 1             1       11
 2             2       17
 3             3       40
 4             4       37
 5             5       43
 6             6       63
 7             7       98
 8             8      114
 9             9       93
 10           10       97,
    company_age  Payments
 0            1         6
 1            2         3
 2            3         4
 3            4         8
 4            5        10
 5            6         9
 6            7        11
 7            8         7
 8            9        13
 9           10         5]

In [73]:
# Merge dataframes together (Join on 'company_age')
from functools import reduce

df_merged = reduce(lambda left,right: pd.merge(left, right, on='company_age', how='left'),df_category_counts)

df_merged

    company_age   All  Financial Services  FinTech  Finance  Payments
0             0   138                  11       11        3       NaN
1             1  1278                  69       69       11       6.0
2             2  2539                 141       68       17       3.0
3             3  5195                 192       66       40       4.0
4             4  5169                 246       62       37       8.0
5             5  4680                 241       43       43      10.0
6             6  4708                 245       19       63       9.0
7             7  4338                 225       20       98      11.0
8             8  3500                 189       18      114       7.0
9             9  3136                 174        8       93      13.0
10           10  2517                 149        2       97       5.0

In [76]:
# Fix the "Payments" column
df_merged['Payments'] = df_merged['Payments'].fillna(0).astype(int)
df_merged

    company_age   All  Financial Services  FinTech  Finance  Payments
0             0   138                  11       11        3         0
1             1  1278                  69       69       11         6
2             2  2539                 141       68       17         3
3             3  5195                 192       66       40         4
4             4  5169                 246       62       37         8
5             5  4680                 241       43       43        10
6             6  4708                 245       19       63         9
7             7  4338                 225       20       98        11
8             8  3500                 189       18      114         7
9             9  3136                 174        8       93        13
10           10  2517                 149        2       97         5

## No. of Funding Rounds

In [1]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [2]:
series = df['num_funding_rounds'].value_counts().sort_index()
series

0.0        4
1.0     6396
2.0     2518
3.0     1304
4.0      780
5.0      429
6.0      246
7.0      151
8.0       94
9.0       46
10.0      22
11.0      18
12.0       7
13.0       5
14.0       7
15.0       3
16.0       2
17.0       1
19.0       1
20.0       1
23.0       1
Name: num_funding_rounds, dtype: int64

In [3]:
df = series.to_frame()
df = series.reset_index().drop(index=0) # Remove no. of rounds == 0
df

    index  num_funding_rounds
1     1.0                6396
2     2.0                2518
3     3.0                1304
4     4.0                 780
5     5.0                 429
6     6.0                 246
7     7.0                 151
8     8.0                  94
9     9.0                  46
10   10.0                  22
11   11.0                  18
12   12.0                   7
13   13.0                   5
14   14.0                   7
15   15.0                   3
16   16.0                   2
17   17.0                   1
18   19.0                   1
19   20.0                   1
20   23.0                   1

In [4]:
df['index'] = df['index'].astype(int).astype(str)
df

   index  num_funding_rounds
1      1                6396
2      2                2518
3      3                1304
4      4                 780
5      5                 429
6      6                 246
7      7                 151
8      8                  94
9      9                  46
10    10                  22
11    11                  18
12    12                   7
13    13                   5
14    14                   7
15    15                   3
16    16                   2
17    17                   1
18    19                   1
19    20                   1
20    23                   1

In [5]:
df.rename(columns={'index': 'x_labels', 'num_funding_rounds': 'y_values'}, inplace=True)
df

   x_labels  y_values
1         1      6396
2         2      2518
3         3      1304
4         4       780
5         5       429
6         6       246
7         7       151
8         8        94
9         9        46
10       10        22
11       11        18
12       12         7
13       13         5
14       14         7
15       15         3
16       16         2
17       17         1
18       19         1
19       20         1
20       23         1

In [6]:
# Sum the "y_values" starting from row 8 to 20
# Also change the x_labels of row 8 to "8+"
df.iloc[7,1] = df.iloc[7:, 1].sum()
df.iloc[7,0] = '≥8'
df = df[:8]    # Only take the first 8 rows
df

  x_labels  y_values
1        1      6396
2        2      2518
3        3      1304
4        4       780
5        5       429
6        6       246
7        7       151
8       ≥8       208

In [7]:
df.to_csv(index=False)

'x_labels,y_values\r\n1,6396\r\n2,2518\r\n3,1304\r\n4,780\r\n5,429\r\n6,246\r\n7,151\r\n≥8,208\r\n'

## No. of Investments by Top 20 Investors

In [11]:
import pandas as pd
df = pd.read_csv("../bulk_export_processed/investors_processed.csv")
df.head()

,uuid,name,type,roles,domain,country_code,region,city,investor_types,investment_count,total_funding_usd,founded_on,closed_on
0,bf4d7b0e-b34d-2fd8-d292-6049c4f7efc7,Zoho,organization,"investor,company",zoho.com,USA,California,Pleasanton,NaN,6.0,NaN,15/9/1996,NaN
1,f4d5ab44-058b-298b-ea81-380e6e9a8eec,Omidyar Network,organization,investor,omidyar.com,USA,California,Redwood City,family_investment_office,315.0,NaN,1/1/2004,NaN
2,df662812-7f97-0b43-9d3e-12f64f504fbb,Facebook,organization,"investor,company",facebook.com,USA,California,Menlo Park,NaN,32.0,1.612282e+10,4/2/2004,NaN
3,a01b8d46-d311-3333-7c34-aa3ae9c03f22,Mark Zuckerberg,person,investor,NaN,USA,California,Palo Alto,angel,8.0,NaN,NaN,NaN
4,084aaa07-0795-1fe8-9c46-98bbeb02cd64,Dustin Moskovitz,person,investor,NaN,USA,California,San Francisco,angel,13.0,NaN,NaN,NaN

In [12]:
# Drop unnecessary columns
keep_col = ['name', 'investment_count']
df = df[keep_col]
df

                                                     name  investment_count
0                                                    Zoho               6.0
1                                         Omidyar Network             315.0
2                                                Facebook              32.0
3                                         Mark Zuckerberg               8.0
4                                        Dustin Moskovitz              13.0
...                                                   ...               ...
168186                                        Sara Wright               NaN
168187  Shanghai Yongquan Yixin Investment Development...               1.0
168188                                     Ignite Capital               NaN
168189                                S&C Messina Capital               NaN
168190                                  Line of Credit.AI               NaN

[168191 rows x 2 columns]

In [13]:
# Drop NaN and filter out investors with investment_count < 100
df.dropna(axis=0, how='any', subset=['investment_count'], inplace=True)
df.drop(df[df['investment_count'] < 100].index, inplace=True)
df

                             name  investment_count
1                 Omidyar Network             315.0
10               Trinity Ventures             444.0
11                          Accel            1499.0
12      Meritech Capital Partners             279.0
26               Mission Ventures             101.0
...                           ...               ...
125169                  Threshold             849.0
126312                    Upscale             110.0
128176      Pegasus Tech Ventures             210.0
131294               WRVI Capital             104.0
149823              FastTrackTech             106.0

[763 rows x 2 columns]

In [14]:
# Cast `investment_count` to int & sort in descending order
df['investment_count'] = df['investment_count'].astype(int)
df.sort_values(by='investment_count', axis=0, ascending=False, inplace=True)

# Get the first 20 rows (ie. top 20 investors)
df = df[:20]

df

                                       name  investment_count
27418  EASME - EU Executive Agency for SMEs              3715
2270                           Y Combinator              3272
51976                             Techstars              3093
15698                          500 Startups              2427
724               New Enterprise Associates              1874
13792                                  SOSV              1830
11                                    Accel              1499
45                          Sequoia Capital              1427
1774                          Intel Capital              1418
14705                         MassChallenge              1342
1753                            IDG Capital              1238
53684                          Venture Kick              1231
83                          Kleiner Perkins              1213
21639                                 Wayra              1158
20250                             Crowdcube              1133
16463                         plug and play              1072
84                Bessemer Venture Partners              1010
9837                                NYSERDA              1004
10111                              SV Angel               932
13301         Right Side Capital Management               914

In [15]:
# Reset the index
df.reset_index(inplace=True)
df.drop(axis=1, labels='index', inplace=True)
df

                                    name  investment_count
0   EASME - EU Executive Agency for SMEs              3715
1                           Y Combinator              3272
2                              Techstars              3093
3                           500 Startups              2427
4              New Enterprise Associates              1874
5                                   SOSV              1830
6                                  Accel              1499
7                        Sequoia Capital              1427
8                          Intel Capital              1418
9                          MassChallenge              1342
10                           IDG Capital              1238
11                          Venture Kick              1231
12                       Kleiner Perkins              1213
13                                 Wayra              1158
14                             Crowdcube              1133
15                         plug and play              1072
16             Bessemer Venture Partners              1010
17                               NYSERDA              1004
18                              SV Angel               932
19         Right Side Capital Management               914

In [16]:
print(df.to_csv(index=False))

name,investment_count
EASME - EU Executive Agency for SMEs,3715
Y Combinator,3272
Techstars,3093
500 Startups,2427
New Enterprise Associates,1874
SOSV,1830
Accel,1499
Sequoia Capital,1427
Intel Capital,1418
MassChallenge,1342
IDG Capital,1238
Venture Kick,1231
Kleiner Perkins,1213
Wayra,1158
Crowdcube,1133
plug and play,1072
Bessemer Venture Partners,1010
NYSERDA,1004
SV Angel,932
Right Side Capital Management,914

## Acquisition Price

In [27]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [28]:
series = df['acquisitions_price_usd']
series

0        0.0
1        0.0
2        0.0
3        0.0
4        0.0
        ...
37193    0.0
37194    0.0
37195    0.0
37196    0.0
37197    0.0
Name: acquisitions_price_usd, Length: 37198, dtype: float64

In [30]:
df = series.to_frame()
df

       acquisitions_price_usd
0                         0.0
1                         0.0
2                         0.0
3                         0.0
4                         0.0
...                       ...
37193                     0.0
37194                     0.0
37195                     0.0
37196                     0.0
37197                     0.0

[37198 rows x 1 columns]

In [31]:
df.rename(columns={'acquisitions_price_usd': 'x_values'}, inplace=True)
df

       x_values
0           0.0
1           0.0
2           0.0
3           0.0
4           0.0
...         ...
37193       0.0
37194       0.0
37195       0.0
37196       0.0
37197       0.0

[37198 rows x 1 columns]

In [32]:
df.to_csv(index = False)

0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n532152690.379562\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n532152690.379562\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n0.0\n'

## Total Funds Raised

In [33]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [34]:
series = df['total_funding_usd']
series

0               NaN
1               NaN
2               NaN
3               NaN
4        25200000.0
            ...
37193           NaN
37194           NaN
37195           NaN
37196    14523274.0
37197     1087000.0
Name: total_funding_usd, Length: 37198, dtype: float64

In [37]:
df = series.to_frame()
df

       total_funding_usd
0                    NaN
1                    NaN
2                    NaN
3                    NaN
4             25200000.0
...                  ...
37193                NaN
37194                NaN
37195                NaN
37196         14523274.0
37197          1087000.0

[37198 rows x 1 columns]

In [47]:
df.rename(columns={'total_funding_usd': 'x_values'}, inplace=True)
df

         x_values
0             NaN
1             NaN
2             NaN
3             NaN
4      25200000.0
...           ...
37193         NaN
37194         NaN
37195         NaN
37196  14523274.0
37197   1087000.0

[37198 rows x 1 columns]

In [52]:
df.dropna(inplace=True)
df

         x_values
4      25200000.0
10      4025000.0
20     13316538.0
28      1700000.0
38     57011648.0
...           ...
37177   1000000.0
37186     65625.0
37188   3700000.0
37196  14523274.0
37197   1087000.0

[9093 rows x 1 columns]

In [ ]:
df.to_csv(index = False)

## Number of Investment

In [19]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [20]:
series = df['investment_count']
df = series.to_frame()

df

       investment_count
0                   0.0
1                   0.0
2                   0.0
3                   0.0
4                   0.0
...                 ...
37193               0.0
37194               0.0
37195               0.0
37196               0.0
37197               0.0

[37198 rows x 1 columns]

In [21]:
df[df < 100].count()

investment_count    36627
dtype: int64

In [22]:
df[df == 0].count()

investment_count    36627
dtype: int64

In [23]:
#drop zero
df = df[~(df == 0).any(axis = 1)]
df

       investment_count
38                315.0
75                244.0
105              1072.0
126               402.0
129               129.0
...                 ...
36784             264.0
36812             315.0
36837             155.0
36857            1830.0
36858             764.0

[571 rows x 1 columns]

In [25]:
df.to_csv(index=False)

'investment_count\n315.0\n244.0\n1072.0\n402.0\n129.0\n764.0\n124.0\n232.0\n2427.0\n145.0\n434.0\n1874.0\n1830.0\n594.0\n1830.0\n635.0\n3093.0\n1213.0\n1830.0\n594.0\n133.0\n219.0\n434.0\n315.0\n116.0\n1072.0\n393.0\n1830.0\n874.0\n317.0\n761.0\n395.0\n1072.0\n224.0\n1874.0\n112.0\n232.0\n189.0\n2427.0\n317.0\n1830.0\n122.0\n1072.0\n313.0\n382.0\n841.0\n312.0\n164.0\n119.0\n153.0\n2427.0\n520.0\n230.0\n157.0\n234.0\n1830.0\n120.0\n1427.0\n111.0\n156.0\n567.0\n376.0\n122.0\n175.0\n126.0\n120.0\n122.0\n324.0\n142.0\n242.0\n460.0\n179.0\n791.0\n313.0\n143.0\n787.0\n156.0\n142.0\n153.0\n635.0\n265.0\n216.0\n123.0\n112.0\n292.0\n222.0\n1072.0\n230.0\n120.0\n395.0\n125.0\n382.0\n1072.0\n199.0\n571.0\n613.0\n198.0\n850.0\n159.0\n787.0\n159.0\n151.0\n1830.0\n850.0\n1427.0\n349.0\n1427.0\n388.0\n402.0\n203.0\n507.0\n393.0\n146.0\n158.0\n370.0\n112.0\n142.0\n764.0\n393.0\n317.0\n850.0\n324.0\n238.0\n219.0\n224.0\n613.0\n3093.0\n153.0\n434.0\n469.0\n244.0\n103.0\n312.0\n276.0\n180.0\n237.0\n189.0\n791.0\n395.0\n230.0\n611.0\n280.0\n580.0\n259.0\n572.0\n237.0\n255.0\n787.0\n123.0\n193.0\n230.0\n120.0\n151.0\n649.0\n1830.0\n1830.0\n141.0\n224.0\n1427.0\n1830.0\n109.0\n230.0\n151.0\n402.0\n193.0\n635.0\n393.0\n515.0\n462.0\n331.0\n176.0\n376.0\n203.0\n312.0\n121.0\n153.0\n3093.0\n613.0\n237.0\n145.0\n155.0\n106.0\n3093.0\n460.0\n1072.0\n849.0\n127.0\n216.0\n850.0\n158.0\n268.0\n157.0\n291.0\n189.0\n566.0\n170.0\n635.0\n323.0\n386.0\n1830.0\n611.0\n101.0\n257.0\n109.0\n126.0\n384.0\n175.0\n1499.0\n444.0\n649.0\n291.0\n189.0\n127.0\n3093.0\n507.0\n268.0\n151.0\n159.0\n862.0\n3093.0\n189.0\n862.0\n156.0\n1874.0\n304.0\n1830.0\n331.0\n157.0\n507.0\n189.0\n144.0\n126.0\n268.0\n132.0\n460.0\n195.0\n127.0\n150.0\n1830.0\n179.0\n388.0\n134.0\n1072.0\n393.0\n134.0\n862.0\n193.0\n123.0\n120.0\n123.0\n862.0\n179.0\n368.0\n340.0\n189.0\n764.0\n157.0\n460.0\n180.0\n1874.0\n193.0\n434.0\n158.0\n124.0\n124.0\n101.0\n477.0\n127.0\n222.0\n233.0\n224.0\n1072.0\n153.0\n230.0\n302.0\n619.0\n106.0\n192.0\n1830.0\n384.0\n215.0\n1213.0\n460.0\n153.0\n874.0\n215.0\n1830.0\n605.0\n111.0\n370.0\n3093.0\n548.0\n1072.0\n106.0\n119.0\n611.0\n657.0\n611.0\n613.0\n116.0\n3093.0\n140.0\n402.0\n276.0\n418.0\n172.0\n348.0\n243.0\n257.0\n386.0\n619.0\n324.0\n1830.0\n507.0\n133.0\n161.0\n1010.0\n1830.0\n189.0\n2427.0\n181.0\n153.0\n580.0\n169.0\n142.0\n469.0\n1072.0\n331.0\n1830.0\n101.0\n460.0\n123.0\n100.0\n230.0\n166.0\n194.0\n460.0\n344.0\n230.0\n189.0\n193.0\n112.0\n189.0\n279.0\n133.0\n103.0\n649.0\n169.0\n156.0\n2427.0\n613.0\n208.0\n1072.0\n152.0\n172.0\n366.0\n255.0\n737.0\n169.0\n255.0\n259.0\n764.0\n222.0\n243.0\n230.0\n172.0\n150.0\n1830.0\n215.0\n120.0\n315.0\n460.0\n395.0\n106.0\n173.0\n236.0\n460.0\n196.0\n402.0\n702.0\n153.0\n2427.0\n128.0\n103.0\n3093.0\n468.0\n233.0\n874.0\n101.0\n515.0\n434.0\n276.0\n131.0\n459.0\n127.0\n459.0\n469.0\n2427.0\n120.0\n507.0\n159.0\n1072.0\n105.0\n1499.0\n611.0\n103.0\n3272.0\n2427.0\n402.0\n112.0\n376.0\n153.0\n611.0\n565.0\n732.0\n1499.0\n177.0\n276.0\n105.0\n1072.0\n105.0\n507.0\n1499.0\n222.0\n106.0\n171.0\n142.0\n111.0\n1072.0\n331.0\n123.0\n112.0\n234.0\n153.0\n1830.0\n566.0\n315.0\n434.0\n315.0\n470.0\n114.0\n144.0\n571.0\n304.0\n515.0\n126.0\n134.0\n444.0\n140.0\n131.0\n611.0\n850.0\n106.0\n3272.0\n194.0\n120.0\n120.0\n862.0\n1830.0\n126.0\n109.0\n3093.0\n302.0\n144.0\n103.0\n611.0\n222.0\n1072.0\n205.0\n613.0\n395.0\n107.0\n315.0\n1213.0\n613.0\n333.0\n2427.0\n217.0\n144.0\n101.0\n144.0\n111.0\n470.0\n203.0\n144.0\n179.0\n1830.0\n515.0\n129.0\n101.0\n189.0\n106.0\n156.0\n572.0\n348.0\n179.0\n515.0\n395.0\n1072.0\n764.0\n195.0\n189.0\n348.0\n103.0\n324.0\n323.0\n127.0\n131.0\n132.0\n1213.0\n2427.0\n270.0\n507.0\n395.0\n155.0\n144.0\n395.0\n219.0\n317.0\n236.0\n235.0\n1830.0\n100.0\n657.0\n265.0\n175.0\n116.0\n101.0\n1072.0\n159.0\n119.0\n143.0\n300.0\n233.0\n379.0\n125.0\n841.0\n1830.0\n378.0\n462.0\n565.0\n567.0\n103.0\n199.0\n572.0\n216.0\n158.0\n169.0\n2427.0\n354.0\n194.0\n348.0\n120.0\n101.0\n122.0\n1830.0\n148.0\n142.0\n377.0\n116.0\n116.0\n169.0\n144.0\n131.0\n649.0\n649.0\n264.0\n315.0\n155.0\n1830.0\n764.0\n'

## No of Companies Owned by Top 20 Founders

In [2]:
import pandas as pd
df = pd.read_csv("../bulk_export_processed/acquisitions_processed.csv")
df

,uuid,rank,acquiree_uuid,acquiree_name,acquiree_country_code,acquiree_region,acquiree_city,acquirer_uuid,acquirer_name,acquirer_country_code,acquirer_region,acquirer_city,acquired_on,price_usd
0,c62807f2-3487-f63b-e7fc-559b752ed44c,26818.0,180ebf67-68d0-2316-e93d-8e1e546330ba,Flektor,USA,California,Culver City,d70777cc-14bd-2416-0692-5a483781b78b,Fox Interactive Media,USA,California,Beverly Hills,30/5/2007,NaN
1,419cabe1-4d71-5f64-3e9b-c9d0fb445cca,51088.0,5b05e013-a448-3a0b-d872-a6ae668e1192,GrandCentral,USA,California,Fremont,6acfa7da-1dbd-936e-d985-cf07a1b27711,Google,USA,California,Mountain View,1/7/2007,60000000.0
2,01bd2058-ccf8-6102-f253-9224a67a592b,35009.0,8249dffa-1ca6-6f99-9f76-d56c83f85f2d,Last.fm,GBR,England,London,f09c1228-2e7d-1889-6647-ba5021b2e4ea,CBS,USA,New York,New York,1/5/2007,280000000.0
3,831becd6-e913-b9f5-ac09-2bff915f9453,41607.0,10dd03fa-69ff-3a82-6321-c6b16c9a9f41,Kosiso - store,USA,Illinois,Chicago,6acfa7da-1dbd-936e-d985-cf07a1b27711,Google,USA,California,Mountain View,23/5/2007,100000000.0
4,9da90ee7-aad7-e0b4-8456-839363032e5e,82210.0,0af10345-613d-e144-f8bd-b62e288985a0,Recipezaar,USA,Washington,Vashon,b5a96cd7-044d-70f0-04c5-f125e57a4b35,Scripps Networks,USA,Tennessee,Knoxville,1/7/2007,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
109820,1e5d9ac2-a293-47b9-a599-bc2be8c3b069,6608.0,88916525-5f2b-4be6-a7b5-0b879ce4efb3,Carl von Linnékliniken,SWE,Uppsala Lan,Uppsala,4aebc204-6b18-4406-bcbb-54b99d60d46f,GeneraLife IVF,ESP,Madrid,Madrid,1/10/2020,NaN
109821,436fabdf-305a-4dc8-88ff-7d333d9ab620,6607.0,2f2a9e5f-1a7e-4916-a240-8f5e8e3c6efc,Demetra,ITA,Lazio,Tuscania,4aebc204-6b18-4406-bcbb-54b99d60d46f,GeneraLife IVF,ESP,Madrid,Madrid,1/10/2020,NaN
109822,99f54962-ec76-4456-8f19-d0f6833e01d2,36988.0,26863a5f-509e-45f6-ac1f-bb4abe63f3b4,Data Driver,CHN,Shanghai,Shanghai,67e319ff-d9e6-49fb-b5b6-cf44af694d08,SGSG Science & Technology Company,CHN,Guangdong,Zhuhai,12/7/2020,7140919.0
109823,bac58cf7-c6a5-4fa2-96e5-6341b9237cb1,1573.0,ba060c5f-6947-4a36-ba63-a0a10ed74df8,Great and Relentless Few Show,NaN,NaN,NaN,f8c3d362-1d7c-4ed8-9a6b-f0fc62edc5d9,Institute of Higher Global Studies | Since 200...,USA,Alabama,Huntsville,25/12/2020,100000.0
109824,8d6b103d-89f9-44e2-8f96-d81c237caa44,NaN,74cfd4e9-e176-4092-90a0-5fad4663a241,Tepia Technology,CHN,Beijing,Haidian,d17f0d6e-ccad-498f-9b80-ed751932c463,Zhejiang Yongan Rongtong Holdings,CHN,Zhejiang,Shaoxing,19/3/2019,13409020.0

In [7]:
series = df['acquirer_name'].value_counts()
series

Gallagher                             372
HUB International                     306
Google                                244
Microsoft                             235
Cisco                                 231
                                     ...
UNUM Therapeutics                       1
Fox and Hound Restaurant                1
Carlisle Interconnect Technologies      1
Global Omnium                           1
Galls                                   1
Name: acquirer_name, Length: 38188, dtype: int64

In [13]:
df = series.to_frame()
df.reset_index(inplace=True)	
df.rename(columns={'index': 'x_labels', 'acquirer_name': 'y_values'}, inplace=True)
df

                                 x_labels  y_values
0                               Gallagher       372
1                       HUB International       306
2                                  Google       244
3                               Microsoft       235
4                                   Cisco       231
...                                   ...       ...
38183                   UNUM Therapeutics         1
38184            Fox and Hound Restaurant         1
38185  Carlisle Interconnect Technologies         1
38186                       Global Omnium         1
38187                               Galls         1

[38188 rows x 2 columns]

In [11]:
df = df[:10]
df

               y_values  x_labels
0             Gallagher       372
1     HUB International       306
2                Google       244
3             Microsoft       235
4                 Cisco       231
5  CVC Capital Partners       217
6     Riverside Company       209
7       AssuredPartners       193
8                   IBM       189
9             Accenture       185

In [12]:
df.to_csv(index=False)

'y_values,x_labels\nGallagher,372\nHUB International,306\nGoogle,244\nMicrosoft,235\nCisco,231\nCVC Capital Partners,217\nRiverside Company,209\nAssuredPartners,193\nIBM,189\nAccenture,185\n'

## Founder Education level

In [32]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [33]:
df_edu = df['degree_type'].value_counts().to_frame()
df_edu.reset_index(inplace=True)
df_edu

   index  degree_type
0    0.0        31760
1    1.0         2701
2    2.0         2535
3    3.0          202

In [34]:
df_edu['index'] = df_edu['index'].astype(int).astype(str)
df_edu.rename(columns={'index': 'x_labels', 'degree_type': 'y_values'}, inplace=True)
df_edu = df_edu[1:]
df_edu

  x_labels  y_values
1        1      2701
2        2      2535
3        3       202

In [35]:
x_label_convert = {1: "Bachelor", 2: "Master", 3: "PhD"}

for key, value in x_label_convert.items():
    df_edu.at[key, 'x_labels'] = value

df_edu

   x_labels  y_values
1  Bachelor      2701
2    Master      2535
3       PhD       202

## Bubble Plot

In [1]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")
df

,company_uuid,country_code,region,city,operating,closed,success,success_acquired,success_ipo,num_funding_rounds,...,has_acquisitions,has_ipo,time_in_year,investment_delta,norm_amount_delta,momentum,ROI,max_norm_amount_delta,mean_norm_amount_delta,roi_from_mean_momentum
0,0001a6ec-e7e9-4d1b-8a77-adb5ac815420,JPN,Tokyo,Tokyo,1,0,0,0,0,NaN,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0003f244-79d0-6178-353e-33dabaf3b2c6,USA,California,San Francisco,1,0,0,0,0,NaN,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,00057beb-5724-c809-5cd2-a0a7c6b017aa,ESP,Madrid,Madrid,1,0,0,0,0,NaN,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,000ab460-8462-450d-ab34-b3c54fc252fd,LKA,Western,Colombo,1,0,0,0,0,NaN,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,000ad7a8-b868-f301-5f00-2a3361288fc9,USA,New York,Brooklyn,1,0,0,0,0,2.0,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37193,fff9249a-baea-49a9-baca-a57b28ee7e6f,USA,California,Los Angeles,1,0,0,0,0,NaN,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37194,fffa7546-aba8-5bbf-11a9-105d61b0dd0e,NLD,Noord-Brabant,Maaskant,1,0,0,0,0,NaN,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37195,fffbd05f-57b7-4fdc-94a6-be656719db8c,CHN,Zhejiang,Ningbo,1,0,0,0,0,NaN,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37196,fffe3b0b-8545-4414-9c0e-a3f961c4e420,CHN,Guangdong,Guangzhou,1,0,0,0,0,1.0,...,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37197,ffffabce-6d4a-b3d1-13c0-4e90cedf5270,USA,New York,New York,1,0,0,0,0,6.0,...,0,0,6.0795,"['grant to angel', 'angel to product_crowdfund...","[1.368421052631579, 0.024691358024691357, 0.87...","[4.161864515302853, 0.06577346303860244, 1.316...",4.161865,1.368421,0.836687,0.087506

In [2]:
df = df[['employee_count', 'degree_type','ROI']]
df

      employee_count  degree_type       ROI
0            unknown          0.0       NaN
1             51-100          2.0       NaN
2               1-10          0.0       NaN
3               1-10          0.0       NaN
4              11-50          0.0       NaN
...              ...          ...       ...
37193          11-50          0.0       NaN
37194          11-50          0.0       NaN
37195        unknown          0.0       NaN
37196        unknown          0.0       NaN
37197           1-10          0.0  4.161865

[37198 rows x 3 columns]

In [3]:
df.dropna(inplace = True)
df

      employee_count  degree_type       ROI
10              1-10          0.0  3.155306
20             11-50          0.0  0.303599
38           101-250          2.0 -0.032928
48             11-50          0.0  0.248205
75             11-50          0.0  0.999467
...              ...          ...       ...
37121          11-50          2.0  0.551227
37127        251-500          0.0 -3.477051
37172        101-250          1.0 -0.223943
37174          11-50          0.0  0.352082
37197           1-10          0.0  4.161865

[3644 rows x 3 columns]

In [4]:
df.drop(df[df['employee_count'] == "unknown"].index, inplace = True)
df

      employee_count  degree_type       ROI
10              1-10          0.0  3.155306
20             11-50          0.0  0.303599
38           101-250          2.0 -0.032928
48             11-50          0.0  0.248205
75             11-50          0.0  0.999467
...              ...          ...       ...
37121          11-50          2.0  0.551227
37127        251-500          0.0 -3.477051
37172        101-250          1.0 -0.223943
37174          11-50          0.0  0.352082
37197           1-10          0.0  4.161865

[3623 rows x 3 columns]

In [5]:
df["employee_count"].value_counts()

11-50         1686
1-10           961
51-100         391
101-250        379
251-500        122
1001-5000       45
501-1000        35
5001-10000       3
10000+           1
Name: employee_count, dtype: int64

In [8]:
df['employee_count'] = df['employee_count'].str.split('-').str[0]
df

      employee_count  degree_type       ROI
10                 1          0.0  3.155306
20                11          0.0  0.303599
38               101          2.0 -0.032928
48                11          0.0  0.248205
75                11          0.0  0.999467
...              ...          ...       ...
37121             11          2.0  0.551227
37127            251          0.0 -3.477051
37172            101          1.0 -0.223943
37174             11          0.0  0.352082
37197              1          0.0  4.161865

[3623 rows x 3 columns]

In [1]:
df.to_csv(index= False)
df

NameError: name 'df' is not defined

## Funding Location

In [8]:
import pandas as pd
import json
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [9]:
df_countries = df['country_code'].value_counts().to_frame()
df_countries

     country_code
USA         11721
GBR          3172
CHN          2903
IND          1627
CAN          1283
..            ...
IRQ             1
NER             1
AIA             1
SOM             1
LCA             1

[162 rows x 1 columns]

In [10]:
df_countries.reset_index(inplace=True)
df_countries.rename(columns={'index': 'country_code', 'country_code': 'count'}, inplace=True)
df_countries

    country_code  count
0            USA  11721
1            GBR   3172
2            CHN   2903
3            IND   1627
4            CAN   1283
..           ...    ...
157          IRQ      1
158          NER      1
159          AIA      1
160          SOM      1
161          LCA      1

[162 rows x 2 columns]